<?php
header("Content-Type: text/html; charset=UTF-8");
$会员投注金额 = 10;
$会员投注赔率 = 97.2;
$输赢状态 = '赢';
if ($输赢状态 == '赢') {
    $会员输赢 = -$会员投注金额;
} else {
    $会员输赢 = $会员投注金额 * $会员投注赔率 - $会员投注金额;
}

$代理占成比例 = '0.05';
$总代占成比例 = '0.05';
$股东占成比例 = '0.15';
$总监占成比例 = '0.7';
$公司占成比例 = '0.05';

$代理赚水比例 = '0.009';
$总代赚水比例 = '0.009';
$股东赚水比例 = '0.009';
$总监赚水比例 = '0';
$公司赚水比例 = '0';

if ($输赢状态 == '输') {
    //代理计算
    $代理占成金额 = $会员投注金额 * $代理占成比例;
    $代理占成盈亏金额 = $代理占成金额;
    $代理赚水金额 = ($会员投注金额 - $代理占成金额) * $代理赚水比例;
    $代理总盈亏金额 = $代理占成盈亏金额 + $代理赚水金额;

    //总代理计算
    $总代占成金额 = $会员投注金额 * $总代占成比例;
    $总代占成盈亏金额 = $总代占成金额 - ($总代占成金额 * $代理赚水比例);
    $总代赚水金额 = ($会员投注金额 - $代理占成金额 - $总代占成金额) * $总代赚水比例;
    $总代总盈亏金额 = $总代占成盈亏金额 + $总代赚水金额;

    //股东计算
    $股东占成金额 = $会员投注金额 * $股东占成比例;
    $股东占成盈亏金额 = $股东占成金额 - ($股东占成金额 * ($总代赚水比例 + $代理赚水比例));
    $股东赚水金额 = ($会员投注金额 - $代理占成金额 - $总代占成金额 - $股东占成金额) * $股东赚水比例;
    $股东总盈亏金额 = $股东占成盈亏金额 + $股东赚水金额;

    //总监计算
    $总监占成金额 = $会员投注金额 * $总监占成比例;
    $总监占成盈亏金额 = $总监占成金额 - ($总监占成金额 * ($股东赚水比例 + $总代赚水比例 + $代理赚水比例));
    $总监赚水金额 = ($会员投注金额 - $代理占成金额 - $总代占成金额 - $股东占成金额 - $总监占成金额) * $总监赚水比例;
    $总监总盈亏金额 = $总监占成盈亏金额 + $总监赚水金额;

    //公司计算
    $公司占成金额 = $会员投注金额 * $公司占成比例;
    $公司占成盈亏金额 = $公司占成金额 - ($公司占成金额 * ($总监赚水比例 + $股东赚水比例 + $总代赚水比例 + $代理赚水比例));
    $公司赚水金额 = ($会员投注金额 - $代理占成金额 - $总代占成金额 - $股东占成金额 - $总监占成金额 - $公司占成金额) * $公司赚水比例;
    $公司总盈亏金额 = $公司占成盈亏金额 + $公司赚水金额;
} else {
    //赢
    //代理计算
    $代理占成金额 = $会员投注金额 * $代理占成比例;
    $代理占成盈亏金额 = $代理占成金额 - ($代理占成金额 * $会员投注赔率);
    $代理赚水金额 = ($会员投注金额 - $代理占成金额) * $代理赚水比例;
    $代理总盈亏金额 = $代理占成盈亏金额 + $代理赚水金额;

    //总代理计算
    $总代占成金额 = $会员投注金额 * $总代占成比例;
    $总代占成盈亏金额 = $总代占成金额-($总代占成金额 * $会员投注赔率)-($代理占成金额 * $代理赚水比例);
    $总代赚水金额 = ($会员投注金额 - $代理占成金额 - $总代占成金额) * $总代赚水比例;
    $总代总盈亏金额 = $总代占成盈亏金额 + $总代赚水金额;

    //股东计算
    $股东占成金额 = $会员投注金额 * $股东占成比例;
    $股东占成盈亏金额 = $股东占成金额 - ($股东占成金额 * $会员投注赔率)- $股东占成金额 *($总代赚水比例 + $代理赚水比例);
    $股东赚水金额 = ($会员投注金额 - $代理占成金额 - $总代占成金额 - $股东占成金额) * $股东赚水比例;
    $股东总盈亏金额 = $股东占成盈亏金额 + $股东赚水金额;

    //总监计算
    $总监占成金额 = $会员投注金额 * $总监占成比例;
    $总监占成盈亏金额 = $总监占成金额-($总监占成金额 * $会员投注赔率) -$总监占成金额 * ($股东赚水比例 + $总代赚水比例 + $代理赚水比例);
    $总监赚水金额 = ($会员投注金额 - $代理占成金额 - $总代占成金额 - $股东占成金额 - $总监占成金额) * $总监赚水比例;
    $总监总盈亏金额 = $总监占成盈亏金额 + $总监赚水金额;

    //公司计算
    $公司占成金额 = $会员投注金额 * $公司占成比例;
    $公司占成盈亏金额 = $公司占成金额 -($公司占成金额 * $会员投注赔率) - $公司占成金额 * ($总监赚水比例 + $股东赚水比例 + $总代赚水比例 + $代理赚水比例);
    $公司赚水金额 = ($会员投注金额 - $代理占成金额 - $总代占成金额 - $股东占成金额 - $总监占成金额 - $公司占成金额) * $公司赚水比例;
    $公司总盈亏金额 = $公司占成盈亏金额 + $公司赚水金额;
}
?>

占成比例：代理(<?php echo $代理占成比例; ?>),　总代(<?php echo $总代占成比例; ?>),　股东(<?php echo $股东占成比例; ?>),　总监(<?php echo $总监占成比例; ?>),　公司(<?php echo $公司占成比例; ?>)
赚水比例：代理(<?php echo $代理赚水比例; ?>),　总代(<?php echo $总代赚水比例; ?>),　股东(<?php echo $股东赚水比例; ?>),　总监(<?php echo $总监赚水比例; ?>),　公司(<?php echo $公司赚水比例; ?>)
会员投注金额：<?php echo $会员投注金额; ?>　输赢状态：<?php echo $输赢状态; ?>　会员投注赔率：<?php echo $会员投注赔率; ?>　会员输赢：<?php echo $会员输赢; ?>


代理：占成金额(<?php echo $代理占成金额; ?>),　占成盈亏(<?php echo $代理占成盈亏金额; ?>),　赚水(<?php echo $代理赚水金额; ?>),　总盈亏(<?php echo $代理总盈亏金额; ?>)
总代：占成金额(<?php echo $总代占成金额; ?>),　占成盈亏(<?php echo $总代占成盈亏金额; ?>),　赚水(<?php echo $总代赚水金额; ?>),　总盈亏(<?php echo $总代总盈亏金额; ?>)
股东：占成金额(<?php echo $股东占成金额; ?>),　占成盈亏(<?php echo $股东占成盈亏金额; ?>),　赚水(<?php echo $股东赚水金额; ?>),　总盈亏(<?php echo $股东总盈亏金额; ?>)
总监：占成金额(<?php echo $总监占成金额; ?>),　占成盈亏(<?php echo $总监占成盈亏金额; ?>),　赚水(<?php echo $总监赚水金额; ?>),　总盈亏(<?php echo $总监总盈亏金额; ?>)
公司：占成金额(<?php echo $公司占成金额; ?>),　占成盈亏(<?php echo $公司占成盈亏金额; ?>),　赚水(<?php echo $公司赚水金额; ?>),　总盈亏(<?php echo $公司总盈亏金额; ?>)

合计总占成金额：<?php echo $代理占成金额 + $总代占成金额 + $股东占成金额 + $总监占成金额 + $公司占成金额; ?>  
合计总占成盈亏金额：<?php echo $代理占成盈亏金额 + $总代占成盈亏金额 + $股东占成盈亏金额 + $总监占成盈亏金额 + $公司占成盈亏金额; ?>  
合计总赚水金额：<?php echo $代理赚水金额 + $总代赚水金额 + $股东赚水金额 + $总监赚水金额 + $公司赚水金额; ?>  
合计总盈亏金额：<?php echo $代理总盈亏金额 + $总代总盈亏金额 + $股东总盈亏金额 + $总监总盈亏金额 + $公司总盈亏金额; ?>  

